# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [11]:
house1 = pd.Series(np.random.randint(1, high=5, size=100))
house2 = pd.Series(np.random.randint(1, high=4, size=100))
house3 = pd.Series(np.random.randint(10000, high=30001, size=100))

print(house1, house2, house3)

0     4
1     2
2     4
3     4
4     3
     ..
95    2
96    2
97    4
98    1
99    2
Length: 100, dtype: int32 0     2
1     3
2     3
3     2
4     1
     ..
95    3
96    3
97    3
98    2
99    1
Length: 100, dtype: int32 0     22713
1     15171
2     19146
3     23033
4     27812
      ...
95    17009
96    14994
97    17340
98    17699
99    28736
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [12]:
market = pd.concat([house1, house2, house3], axis=1)
market.head()

   0  1      2
0  4  2  22713
1  2  3  15171
2  4  3  19146
3  4  2  23033
4  3  1  27812

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [13]:
market.columns = ['berds', 'bathrs', 'price_sqr_meter']
market.head()

   berds  bathrs  price_sqr_meter
0      4       2            22713
1      2       3            15171
2      4       3            19146
3      4       2            23033
4      3       1            27812

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [17]:
bigcolumn = pd.concat([house1, house2, house3], axis=0)

bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       4
1       2
2       4
3       4
4       3
..    ...
95  17009
96  14994
97  17340
98  17699
99  28736

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [18]:
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [20]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        4
1        2
2        4
3        4
4        3
..     ...
295  17009
296  14994
297  17340
298  17699
299  28736

[300 rows x 1 columns]